{
  "irVersion": "1.0",
  "project": "vibium-go",
  "repository": "https://github.com/agentplexus/vibium-go",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["agentplexus"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-02-28",
      "highlights": [
        { "description": "Repository migration from `grokify/vibium-go` to `agentplexus/vibium-go`" },
        { "description": "Code quality improvements and lint fixes" }
      ],
      "breaking": [
        { "description": "Module path changed from `github.com/grokify/vibium-go` to `github.com/agentplexus/vibium-go`", "commit": "99bb6f2" }
      ],
      "changed": [
        { "description": "Reduced duplication in MCP element handlers with `elementOp` helper function", "commit": "42d1066" }
      ],
      "fixed": [
        { "description": "Handle unchecked errors in RPA executor for browser cleanup and error handler steps", "commit": "d173bec" },
        { "description": "Tighten file permissions from 0644 to 0600 for security (gosec G306)", "commit": "01b295b" },
        { "description": "Fix gofmt formatting in RPA types", "commit": "bc60e9d" }
      ],
      "documentation": [
        { "description": "Add release notes for v0.2.0 and reorganize releases into `docs/releases/`", "commit": "be818e6" },
        { "description": "Update documentation for clicker availability and repo migration", "commit": "0d4fdc5" },
        { "description": "Update README diagram", "commit": "00b65f0" }
      ],
      "infrastructure": [
        { "description": "Make E2E tests manual until clicker binary is distributed", "commit": "43aff3a" },
        { "description": "Suppress false positive lint warnings with nolint directives", "commit": "1924385" },
        { "description": "Fix various golangci-lint issues", "commit": "df9373f" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-31",
      "highlights": [
        { "description": "Go client for Vibium browser automation platform with full feature parity with JavaScript and Python clients" }
      ],
      "added": [
        { "description": "Core types: `BoundingBox`, `ElementInfo`, `LaunchOptions`, `FindOptions`, `ActionOptions`", "commit": "e6ba8d0" },
        { "description": "Custom error types: `ConnectionError`, `TimeoutError`, `ElementNotFoundError`, `BrowserCrashedError`, `BiDiError`", "commit": "e6ba8d0" },
        { "description": "BiDi WebSocket client for browser communication", "commit": "4f73d02" },
        { "description": "Clicker process management with binary discovery via `VIBIUM_CLICKER_PATH`, PATH, and cache directory", "commit": "3f36cf0" },
        { "description": "`Element` type with `Click()`, `Type()`, `Text()`, `GetAttribute()`, `BoundingBox()`, `Center()`, `WaitFor()` methods", "commit": "b33b123" },
        { "description": "`Vibe` browser control with `Launch()`, `Go()`, `Screenshot()`, `Find()`, `Evaluate()`, `Quit()` methods", "commit": "b33b123" },
        { "description": "Debug logging with `slog` via `VIBIUM_DEBUG` environment variable", "commit": "48598c6" },
        { "description": "Navigation methods: `Reload()`, `Back()`, `Forward()`, `WaitForNavigation()`", "commit": "91ad5be" },
        { "description": "`FindAll()` method for finding multiple elements by CSS selector", "commit": "91ad5be" }
      ],
      "changed": [
        { "description": "Environment variable renamed from `HEADLESS` to `VIBIUM_HEADLESS` for consistency", "commit": "a404d5e" }
      ],
      "fixed": [
        { "description": "Format `bidi.go` with gofmt and tighten file permissions to 0600", "commit": "f60f34f" },
        { "description": "`FindAll` parsing to handle BiDi array serialization by returning JSON from JavaScript", "commit": "a839387" },
        { "description": "Relaxed test assertions for example.com content changes", "commit": "a839387" }
      ],
      "tests": [
        { "description": "Example tests with testable examples for documentation", "commit": "5c4aeac" },
        { "description": "Integration tests for `example.com` with page title, element finding, screenshots, and JavaScript evaluation", "commit": "3f184e8" },
        { "description": "Integration tests for `the-internet.herokuapp.com` with dynamic elements, inputs, checkboxes, dropdowns, and navigation", "commit": "3f184e8" }
      ],
      "documentation": [
        { "description": "Package documentation with godoc comments", "commit": "8236d7e" },
        { "description": "README with feature parity table, installation, quick start, and API reference", "commit": "8236d7e" },
        { "description": "Documentation for debug logging, navigation methods, and `FindAll`", "commit": "91fd20f" },
        { "description": "Testing section with unit and integration test instructions", "commit": "84388af" },
        { "description": "Repository badges for build status, lint, Go Report Card, and license", "commit": "df0b67c" }
      ],
      "infrastructure": [
        { "description": "Go module files (`go.mod`, `go.sum`)", "commit": "cb7a6f9" },
        { "description": "Project configuration files", "commit": "1e66b00" }
      ]
    }
  ]
}
